; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/rovers/domain.pddl
;; updates:
;;   - since actions are performed sequentially and immediately
;;     'channel_free' and 'available' predicates are removed
;;   -

(define (domain rover)
(:requirements :strips :typing)
(:types rover waypoint store camera mode lander objective)

(:predicates
    (at ?x - rover ?y - waypoint)
    (at_lander ?x - lander ?y - waypoint)
    (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
    (equipped_for_rock_analysis ?r - rover)
    (equipped_for_imaging ?r - rover)
    (empty ?s - store)
    (have_rock_analysis ?r - rover ?w - waypoint)
    (have_soil_analysis ?r - rover ?w - waypoint)
    (full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
    (visible ?w - waypoint ?p - waypoint)
    (have_image ?r - rover ?o - objective ?m - mode)
    (communicated_soil_data ?w - waypoint)
    (communicated_rock_data ?w - waypoint)
    (communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
    (visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
)

(:action navigate
:parameters (?x - rover ?y - waypoint ?z - waypoint)
:precondition (and
    (can_traverse ?x ?y ?z)
    (at ?x ?y)
    (visible ?y ?z))
:effect (and
    (not (at ?x ?y))
    (at ?x ?z))
)

(:action sample_soil
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_soil_sample ?p)
	(equipped_for_soil_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_soil_analysis ?x ?p)
    (not (at_soil_sample ?p)))
)

(:action sample_rock
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_rock_sample ?p)
	(equipped_for_rock_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_rock_analysis ?x ?p)
	(not (at_rock_sample ?p)))
)

(:action drop
:parameters (?x - rover ?y - store)
:precondition (and
    (store_of ?y ?x)
    (full ?y))
:effect (and
    (not (full ?y))
    (empty ?y))
)

(:action calibrate
 :parameters (?r - rover ?i - camera ?t - objective ?w - waypoint)
 :precondition (and
    (equipped_for_imaging ?r)
    (calibration_target ?i ?t)
    (at ?r ?w)
    (visible_from ?t ?w)
    (on_board ?i ?r))
 :effect (and
    (calibrated ?i ?r))
)

(:action take_image
 :parameters (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
 :precondition (and
    (calibrated ?i ?r)
    (on_board ?i ?r)
    (equipped_for_imaging ?r)
    (supports ?i ?m)
    (visible_from ?o ?p)
    (at ?r ?p))
 :effect (and
    (have_image ?r ?o ?m)
    (not (calibrated ?i ?r)))
)

(:action communicate_soil_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_soil_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_soil_data ?p))
)

(:action communicate_rock_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_rock_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_rock_data ?p))
)

(:action communicate_image_data
 :parameters (?r - rover ?l - lander ?o - objective ?m - mode
	      ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_image ?r ?o ?m)
    (visible ?x ?y))
 :effect (and
    (communicated_image_data ?o ?m)))
)

; problem
;; rovers=3, waypoints=8, cameras=3, objectives=6, out_folder=training/easy, instance_id=62, seed=97

(define (problem rover-62)
 (:domain rover)
 (:objects 
    general - lander
    colour high_res low_res - mode
    rover1 rover2 rover3 - rover
    rover1store rover2store rover3store - store
    waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 - waypoint
    camera1 camera2 camera3 - camera
    objective1 objective2 objective3 objective4 objective5 objective6 - objective)
 (:init 
    (at_lander general waypoint4)
    (at rover1 waypoint7)
    (at rover2 waypoint6)
    (at rover3 waypoint1)
    (equipped_for_soil_analysis rover2)
    (equipped_for_soil_analysis rover1)
    (equipped_for_soil_analysis rover3)
    (equipped_for_rock_analysis rover1)
    (equipped_for_rock_analysis rover3)
    (equipped_for_rock_analysis rover2)
    (equipped_for_imaging rover1)
    (empty rover1store)
    (empty rover2store)
    (empty rover3store)
    (store_of rover1store rover1)
    (store_of rover2store rover2)
    (store_of rover3store rover3)
    (at_rock_sample waypoint1)
    (at_rock_sample waypoint4)
    (at_rock_sample waypoint6)
    (at_rock_sample waypoint8)
    (at_soil_sample waypoint3)
    (at_soil_sample waypoint4)
    (at_soil_sample waypoint5)
    (at_soil_sample waypoint6)
    (at_soil_sample waypoint7)
    (at_soil_sample waypoint8)
    (visible waypoint6 waypoint2)
    (visible waypoint1 waypoint2)
    (visible waypoint2 waypoint1)
    (visible waypoint6 waypoint5)
    (visible waypoint4 waypoint6)
    (visible waypoint6 waypoint4)
    (visible waypoint6 waypoint7)
    (visible waypoint7 waypoint6)
    (visible waypoint2 waypoint6)
    (visible waypoint5 waypoint6)
    (visible waypoint5 waypoint3)
    (visible waypoint8 waypoint2)
    (visible waypoint3 waypoint5)
    (visible waypoint2 waypoint8)
    (visible waypoint1 waypoint7)
    (visible waypoint7 waypoint1)
    (visible waypoint1 waypoint4)
    (visible waypoint4 waypoint1)
    (visible waypoint3 waypoint8)
    (visible waypoint8 waypoint3)
    (visible waypoint1 waypoint6)
    (visible waypoint6 waypoint1)
    (can_traverse rover1 waypoint6 waypoint2)
    (can_traverse rover1 waypoint1 waypoint2)
    (can_traverse rover1 waypoint2 waypoint1)
    (can_traverse rover1 waypoint6 waypoint5)
    (can_traverse rover1 waypoint4 waypoint6)
    (can_traverse rover1 waypoint6 waypoint4)
    (can_traverse rover1 waypoint6 waypoint7)
    (can_traverse rover1 waypoint7 waypoint6)
    (can_traverse rover1 waypoint2 waypoint6)
    (can_traverse rover1 waypoint5 waypoint6)
    (can_traverse rover1 waypoint5 waypoint3)
    (can_traverse rover1 waypoint8 waypoint2)
    (can_traverse rover1 waypoint3 waypoint5)
    (can_traverse rover1 waypoint2 waypoint8)
    (can_traverse rover1 waypoint1 waypoint7)
    (can_traverse rover1 waypoint7 waypoint1)
    (can_traverse rover1 waypoint1 waypoint4)
    (can_traverse rover1 waypoint4 waypoint1)
    (can_traverse rover1 waypoint1 waypoint6)
    (can_traverse rover1 waypoint6 waypoint1)
    (can_traverse rover2 waypoint6 waypoint2)
    (can_traverse rover2 waypoint1 waypoint2)
    (can_traverse rover2 waypoint2 waypoint1)
    (can_traverse rover2 waypoint6 waypoint5)
    (can_traverse rover2 waypoint4 waypoint6)
    (can_traverse rover2 waypoint6 waypoint4)
    (can_traverse rover2 waypoint6 waypoint7)
    (can_traverse rover2 waypoint7 waypoint6)
    (can_traverse rover2 waypoint2 waypoint6)
    (can_traverse rover2 waypoint5 waypoint6)
    (can_traverse rover2 waypoint5 waypoint3)
    (can_traverse rover2 waypoint8 waypoint2)
    (can_traverse rover2 waypoint3 waypoint5)
    (can_traverse rover2 waypoint2 waypoint8)
    (can_traverse rover2 waypoint1 waypoint7)
    (can_traverse rover2 waypoint7 waypoint1)
    (can_traverse rover3 waypoint6 waypoint2)
    (can_traverse rover3 waypoint1 waypoint2)
    (can_traverse rover3 waypoint2 waypoint1)
    (can_traverse rover3 waypoint6 waypoint5)
    (can_traverse rover3 waypoint4 waypoint6)
    (can_traverse rover3 waypoint6 waypoint4)
    (can_traverse rover3 waypoint6 waypoint7)
    (can_traverse rover3 waypoint7 waypoint6)
    (can_traverse rover3 waypoint2 waypoint6)
    (can_traverse rover3 waypoint5 waypoint6)
    (can_traverse rover3 waypoint5 waypoint3)
    (can_traverse rover3 waypoint8 waypoint2)
    (can_traverse rover3 waypoint3 waypoint5)
    (can_traverse rover3 waypoint2 waypoint8)
    (calibration_target camera1 objective4)
    (on_board camera1 rover1)
    (supports camera1 low_res)
    (supports camera1 colour)
    (calibration_target camera2 objective1)
    (on_board camera2 rover1)
    (supports camera2 colour)
    (supports camera2 high_res)
    (calibration_target camera3 objective1)
    (on_board camera3 rover1)
    (supports camera3 high_res)
    (supports camera3 low_res)
    (visible_from objective1 waypoint2)
    (visible_from objective1 waypoint4)
    (visible_from objective1 waypoint3)
    (visible_from objective1 waypoint7)
    (visible_from objective1 waypoint6)
    (visible_from objective1 waypoint8)
    (visible_from objective1 waypoint1)
    (visible_from objective1 waypoint5)
    (visible_from objective2 waypoint8)
    (visible_from objective3 waypoint6)
    (visible_from objective3 waypoint3)
    (visible_from objective3 waypoint1)
    (visible_from objective3 waypoint8)
    (visible_from objective3 waypoint2)
    (visible_from objective3 waypoint4)
    (visible_from objective3 waypoint7)
    (visible_from objective4 waypoint7)
    (visible_from objective4 waypoint2)
    (visible_from objective4 waypoint5)
    (visible_from objective5 waypoint1)
    (visible_from objective5 waypoint5)
    (visible_from objective5 waypoint4)
    (visible_from objective6 waypoint2)
    (visible_from objective6 waypoint6)
    (visible_from objective6 waypoint3)
    (visible_from objective6 waypoint4))
 (:goal  (and 
    
    (communicated_soil_data waypoint6)
    (communicated_soil_data waypoint4)
    (communicated_soil_data waypoint8)
    (communicated_soil_data waypoint3)
    (communicated_soil_data waypoint7)
    (communicated_image_data objective3 high_res)
    (communicated_image_data objective2 low_res)
    (communicated_image_data objective5 low_res))))

; plan
1. (calibrate rover1 camera3 objective1 waypoint7)
   added: (calibrated camera3 rover1)
   goals met: 0 of 8
2. (sample_soil rover1 rover1store waypoint7)
   deleted: (empty rover1store) (at_soil_sample waypoint7)
   added: (full rover1store) (have_soil_analysis rover1 waypoint7)
   goals met: 0 of 8
3. (navigate rover1 waypoint7 waypoint1)
   deleted: (at rover1 waypoint7)
   added: (at rover1 waypoint1)
   goals met: 0 of 8
4. (communicate_soil_data rover1 general waypoint7 waypoint1 waypoint4)
   added: (communicated_soil_data waypoint7)
   goals met: 1 of 8
5. (navigate rover1 waypoint1 waypoint2)
   deleted: (at rover1 waypoint1)
   added: (at rover1 waypoint2)
   goals met: 1 of 8
6. (navigate rover2 waypoint6 waypoint5)
   deleted: (at rover2 waypoint6)
   added: (at rover2 waypoint5)
   goals met: 1 of 8
7. (navigate rover2 waypoint5 waypoint3)
   deleted: (at rover2 waypoint5)
   added: (at rover2 waypoint3)
   goals met: 1 of 8
8. (sample_soil rover2 rover2store waypoint3)
   deleted: (empty rover2store) (at_soil_sample waypoint3)
   added: (full rover2store) (have_soil_analysis rover2 waypoint3)
   goals met: 1 of 8
9. (navigate rover2 waypoint3 waypoint5)
   deleted: (at rover2 waypoint3)
   added: (at rover2 waypoint5)
   goals met: 1 of 8
10. (navigate rover2 waypoint5 waypoint6)
   deleted: (at rover2 waypoint5)
   added: (at rover2 waypoint6)
   goals met: 1 of 8
11. (communicate_soil_data rover2 general waypoint3 waypoint6 waypoint4)
   added: (communicated_soil_data waypoint3)
   goals met: 2 of 8
12. (navigate rover1 waypoint2 waypoint8)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint8)
   goals met: 2 of 8
13. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 2 of 8
14. (sample_soil rover1 rover1store waypoint8)
   deleted: (empty rover1store) (at_soil_sample waypoint8)
   added: (full rover1store) (have_soil_analysis rover1 waypoint8)
   goals met: 2 of 8
15. (take_image rover1 waypoint8 objective2 camera3 low_res)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective2 low_res)
   goals met: 2 of 8
16. (calibrate rover1 camera3 objective1 waypoint8)
   added: (calibrated camera3 rover1)
   goals met: 2 of 8
17. (navigate rover1 waypoint8 waypoint2)
   deleted: (at rover1 waypoint8)
   added: (at rover1 waypoint2)
   goals met: 2 of 8
18. (navigate rover1 waypoint2 waypoint1)
   deleted: (at rover1 waypoint2)
   added: (at rover1 waypoint1)
   goals met: 2 of 8
19. (communicate_soil_data rover1 general waypoint8 waypoint1 waypoint4)
   added: (communicated_soil_data waypoint8)
   goals met: 3 of 8
20. (communicate_image_data rover1 general objective2 low_res waypoint1 waypoint4)
   added: (communicated_image_data objective2 low_res)
   goals met: 4 of 8
21. (calibrate rover1 camera2 objective1 waypoint1)
   added: (calibrated camera2 rover1)
   goals met: 4 of 8
22. (take_image rover1 waypoint1 objective3 camera2 high_res)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective3 high_res)
   goals met: 4 of 8
23. (take_image rover1 waypoint1 objective5 camera3 low_res)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective5 low_res)
   goals met: 4 of 8
24. (communicate_image_data rover1 general objective5 low_res waypoint1 waypoint4)
   added: (communicated_image_data objective5 low_res)
   goals met: 5 of 8
25. (communicate_image_data rover1 general objective3 high_res waypoint1 waypoint4)
   added: (communicated_image_data objective3 high_res)
   goals met: 6 of 8
26. (navigate rover1 waypoint1 waypoint4)
   deleted: (at rover1 waypoint1)
   added: (at rover1 waypoint4)
   goals met: 6 of 8
27. (drop rover2 rover2store)
   deleted: (full rover2store)
   added: (empty rover2store)
   goals met: 6 of 8
28. (sample_soil rover2 rover2store waypoint6)
   deleted: (empty rover2store) (at_soil_sample waypoint6)
   added: (full rover2store) (have_soil_analysis rover2 waypoint6)
   goals met: 6 of 8
29. (communicate_soil_data rover2 general waypoint6 waypoint6 waypoint4)
   added: (communicated_soil_data waypoint6)
   goals met: 7 of 8
30. (drop rover1 rover1store)
   deleted: (full rover1store)
   added: (empty rover1store)
   goals met: 7 of 8
31. (sample_soil rover1 rover1store waypoint4)
   deleted: (empty rover1store) (at_soil_sample waypoint4)
   added: (full rover1store) (have_soil_analysis rover1 waypoint4)
   goals met: 7 of 8
32. (navigate rover1 waypoint4 waypoint1)
   deleted: (at rover1 waypoint4)
   added: (at rover1 waypoint1)
   goals met: 7 of 8
33. (communicate_soil_data rover1 general waypoint4 waypoint1 waypoint4)
   added: (communicated_soil_data waypoint4)
   goals met: 8 of 8
